# GetAnalyticalModelSupports Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..GetAnalyticalModelSupports Method
AnalyticalModel Class See Also
---
Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical Support Information from Elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<AnalyticalModelSupport> GetAnalyticalModelSupports()
```

Visual Basic
---
```text
Public Function GetAnalyticalModelSupports As IList(Of AnalyticalModelSupport)
```

Visual C++
---
```text
public:
IList<AnalyticalModelSupport^>^ GetAnalyticalModelSupports()
```

# ### Return Value
Array of AnalyticalModelSupport objects, each one representing a support.
# Remarks
If an Element is not supported by anything, the array returned should be empty.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace